// @strict-types

#Область ОбработчикиСобытий

//@skip-check module-accessibility-at-client
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = СписокНоменклатуры.Итог("Сумма");
	
	СуммыСовпадают = ПроверитьТЧ();
	
	Если Не СуммыСовпадают Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-accessibility-at-client
Функция ПроверитьТЧ()
	
	СуммаТЧ = 0;
	Для Каждого Строка Из СписокНоменклатуры Цикл
		СуммаТЧ = СуммаТЧ + Строка.Сумма;
	КонецЦикла;
		
	Возврат СуммаТЧ = СуммаДокумента;
	
КонецФункции

#КонецОбласти